test_cases/wallBoiling_template/0.orig/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0.5";
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14000
(
(2.02529534 -6.07694972e-06 -3.7368525e-17)
(2.02585169 -2.67837957e-06 1.65744607e-18)
(2.02597 -3.52617717e-06 8.30507944e-18)
(2.02570111 -7.1362098e-06 8.67223405e-18)
(2.02508573 -1.00921617e-05 4.00647341e-18)
(2.02413155 -1.26277349e-05 5.7901572e-17)
(2.02282514 -1.48085246e-05 8.39690905e-17)
(2.02113991 -1.6722676e-05 9.19365576e-17)
...
)
;

boundaryField
{
    inlet
    {
        type            mapped;
        field           U.gas;
        setAverage      0;
        average         (1.75175 0 0);
        interpolationScheme cell;
        value           nonuniform List<vector> 
40
(
(2.02550455 -1.00189244e-05 2.33856983e-17)
(2.02605565 -4.0108774e-06 4.71396866e-17)
(2.02616777 -2.44944094e-06 2.04433025e-17)
(2.02589096 -4.24125769e-06 3.10312764e-17)
(2.02526573 -5.46863868e-06 -4.11560711e-18)
(2.02429969 -6.52674389e-06 3.80006081e-17)
(2.02297949 -7.45207384e-06 5.81417489e-17)
(2.02127875 -8.24412158e-06 7.69954329e-17)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           nonuniform List<vector> 
40
(
(2.02511474 4.21382111e-07 7.56921603e-17)
(2.02529466 2.30717334e-07 1.87569544e-16)
(2.02462294 1.09435171e-07 1.1487591e-16)
(2.02356661 7.98289024e-08 9.57327258e-17)
(2.02232899 6.53321557e-08 1.02936296e-16)
(2.02094048 6.24677062e-08 9.5791189e-17)
(2.01935498 6.62237546e-08 7.91935047e-17)
(2.01750164 7.4355911e-08 5.25603591e-17)
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            slip;
    }
}


// ************************************************************************* //
