test_cases/wallBoiling_template/0.orig/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0.5";
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14000
(
(1.94464066 -1.43420122e-06 -3.78799969e-17)
(1.94519772 -2.54020187e-06 2.89510754e-19)
(1.94530988 -4.09004467e-06 7.2227341e-18)
(1.94502918 -5.66727927e-06 8.82589195e-18)
(1.94439698 -7.16885748e-06 4.37145486e-18)
(1.94342164 -8.54231558e-06 5.90571171e-17)
(1.94209019 -9.7597861e-06 8.47462264e-17)
(1.94037654 -1.08035545e-05 9.26668515e-17)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        field           U.liquid;
        setAverage      1;
        average         (1.75175 0 0);
        interpolationScheme cell;
        value           nonuniform List<vector> 
40
(
(1.94496801 -1.28352633e-06 2.21405653e-17)
(1.94552237 -2.1155799e-06 5.21699713e-17)
(1.94562965 -3.22798321e-06 1.80211217e-17)
(1.94534137 -4.29426254e-06 2.77811361e-17)
(1.94469952 -5.27666243e-06 -6.52171303e-18)
(1.9437124 -6.17415339e-06 3.76979055e-17)
(1.94236718 -6.98635771e-06 5.65524524e-17)
(1.94063798 -7.71267391e-06 7.78095874e-17)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.liquid;
        value           nonuniform List<vector> 
40
(
(1.93261867 2.25880713e-08 7.62296135e-17)
(1.93323106 2.39623925e-08 1.88755243e-16)
(1.93279754 2.24163027e-08 1.15888908e-16)
(1.93184013 1.91559064e-08 9.27777303e-17)
(1.93062214 1.70997564e-08 9.96707499e-17)
(1.92921192 1.69814779e-08 9.14306725e-17)
(1.92758546 1.88303284e-08 7.80941266e-17)
(1.92568336 2.23976802e-08 5.19458348e-17)
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
