test_cases/wallBoiling_template/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
2669791.55
2669791.55
2669791.55
2669791.55
2669791.55
2669791.55
2669791.56
2669791.56
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
2669847.44
2669847.44
2669847.44
2669847.44
2669847.44
2669847.44
2669847.44
2669847.44
...
)
;
    }
    outlet
    {
        type            calculated;
        value           uniform 2620000;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
350
(
2669791.57
2669667.41
2669543.2
2669418.79
2669294.26
2669169.66
2669044.91
2668920.03
...
)
;
    }
}


// ************************************************************************* //
