test_cases/wallBoiling_template/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
2669847.44
2669847.44
2669847.44
2669847.44
2669847.44
2669847.45
2669847.45
2669847.45
...
)
;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
2669847.44
2669847.44
2669847.44
2669847.44
2669847.44
2669847.45
2669847.45
2669847.45
...
)
;
    }
    outlet
    {
        type            prghPressure;
        p               uniform 2620000;
        value           nonuniform List<scalar> 
40
(
2659097.99
2659097.99
2659097.99
2659097.99
2659097.99
2659097.99
2659097.99
2659097.99
...
)
;
        rho             rho;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
350
(
2669847.45
2669835.07
2669822.63
2669810
2669797.26
2669784.46
2669771.52
2669758.42
...
)
;
    }
}


// ************************************************************************* //
