test_cases/wallBoiling_template/0.orig/T.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      T.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
341.720484
341.720484
341.720484
341.720484
341.720485
341.720486
341.720489
341.720492
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 341.65;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      uniform 341.65;
        value           nonuniform List<scalar> 
40
(
341.671263
341.671263
341.671263
341.671262
341.671262
341.671261
341.67126
341.67126
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            copiedFixedValue;
        sourceFieldName T.liquid;
        value           nonuniform List<scalar> 
350
(
341.677536
341.686867
341.687104
341.683305
341.674545
341.666258
341.662594
341.662992
...
)
;
    }
}


// ************************************************************************* //
