test_cases/wallBoiling_template/0.orig/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
341.673881
341.673881
341.673881
341.673882
341.673884
341.673886
341.673889
341.673894
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 341.67;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 341.67;
        value           nonuniform List<scalar> 
40
(
341.671165
341.671165
341.671165
341.671165
341.671164
341.671164
341.671163
341.671162
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            fixedMultiPhaseHeatFlux;
        relax           0.6;
        q               uniform 73890;
        value           nonuniform List<scalar> 
350
(
341.677513
341.68718
341.687556
341.684011
341.675384
341.666996
341.663115
341.663375
...
)
;
    }
}


// ************************************************************************* //
