test_cases/wallBoiling_template/0.orig/alphat.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      alphat.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
0.0672671737
0.0670775799
0.066678937
0.0661001742
0.0653654097
0.0645009923
0.0635415223
0.0625925775
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.0684527917
0.0682953129
0.0679611418
0.0674759341
0.0668643275
0.0661578299
0.0653936326
0.0646409491
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            compressible::alphatWallBoilingWallFunction;
        Prt             0.85;
        value           uniform 0;
        otherPhase      gas;
        relax           0.6;
        dmdtf           uniform 0;
        phaseType       liquid;
        alphatConv      uniform 0;
        dDep            nonuniform List<scalar> 
350
(
0.000156376568
0.000156420102
0.000156430551
0.000156427854
0.000156407002
0.000156386059
0.000156380309
0.000156389291
...
)
;
        qQuenching      uniform 0;
        partitioningModel 
        {
            type            Lavieville;
            alphaCrit       0.2;
        }
        nucleationSiteModel 
        {
            type            LemmertChawla;
            Cn              1;
            NRef            30000000;
            deltaTRef       10;
        }
        departureDiamModel 
        {
            type            TolubinskiKostanchuk;
            dRef            0.00024;
            dMax            0.0014;
            dMin            1e-06;
        }
        departureFreqModel 
        {
            type            KocamustafaogullariIshii;
            Cf              1.18;
        }
    }
}


// ************************************************************************* //
