test_cases/wallBoiling_template/0.orig/k.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      k.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
0.00268353463
0.00270018562
0.00273623825
0.00279129868
0.0028660441
0.00296162996
0.00307952467
0.0032205855
...
)
;

boundaryField
{
    inlet
    {
        type            mapped;
        field           k.liquid;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           nonuniform List<scalar> 
40
(
0.00268099583
0.00269735675
0.00273318776
0.00278800004
0.00286244845
0.002957686
0.00307518912
0.00321583349
...
)
;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 3.75e-05;
        value           nonuniform List<scalar> 
40
(
0.00285315593
0.0028713735
0.00291120664
0.002971428
0.00305237216
0.00315508085
0.00328084303
0.00343053437
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
350
(
0.0175701522
0.0175699081
0.0175689905
0.0175670044
0.0175645718
0.0175623105
0.0175601456
0.0175579058
...
)
;
    }
}


// ************************************************************************* //
