test_cases/wallBoiling_template/0.orig/nut.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      nut.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
5.90482347e-05
5.8883192e-05
5.85361927e-05
5.80326487e-05
5.73938284e-05
5.66429547e-05
5.58107592e-05
5.49903672e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
5.90397881e-05
5.88761629e-05
5.85281619e-05
5.80225209e-05
5.7380747e-05
5.66260733e-05
5.57890434e-05
5.49625819e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
6.01507745e-05
6.00139246e-05
5.9724119e-05
5.93046072e-05
5.87767128e-05
5.81674481e-05
5.75086153e-05
5.68587608e-05
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
350
(
2.84451591e-07
2.84452996e-07
2.8444471e-07
2.8442501e-07
2.84399277e-07
2.8437523e-07
2.84353732e-07
2.8433305e-07
...
)
;
    }
}


// ************************************************************************* //
