test_cases/wallBoiling_template/0.orig/omega.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      omega.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
45.4464836
45.8566448
46.7443838
48.0987641
49.936451
52.285937
55.1779749
58.5663574
...
)
;

boundaryField
{
    inlet
    {
        type            mapped;
        field           omega.liquid;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           nonuniform List<scalar> 
40
(
45.4099839
45.8140717
46.6986776
48.0503086
49.8851723
52.2318754
55.1217395
58.5095056
...
)
;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 0.0015;
        value           nonuniform List<scalar> 
40
(
47.433403
47.8451213
48.7442374
50.1045053
51.9316583
54.2413489
57.0495919
60.3343148
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
350
(
7124.73306
7124.72038
7124.50925
7124.05698
7123.52338
7123.02429
7122.53223
7122.02063
...
)
;
    }
}


// ************************************************************************* //
