test_cases/wallBoiling_template/0.orig/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0.5";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
27610
(
-8.3922788e-14
1.87462456e-09
-3.56809373e-13
5.49394872e-09
-8.14843839e-13
8.92197721e-09
-1.4375401e-12
1.21644641e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-1.87461949e-09
-5.49390683e-09
-8.92189429e-09
-1.21643529e-08
-1.52272529e-08
-1.81164216e-08
-2.08374026e-08
-2.33954074e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
1.8630334e-09
5.46013234e-09
8.8645545e-09
1.20819302e-08
1.51194436e-08
1.79840162e-08
2.06818084e-08
2.32182435e-08
...
)
;
    }
    front
    {
        type            wedge;
        value           nonuniform List<scalar> 
14000
(
-1.49296356e-22
-5.26207736e-23
5.89144274e-23
-1.80468655e-21
4.25609955e-21
-8.33359724e-21
1.08322175e-20
5.43722761e-22
...
)
;
    }
    back
    {
        type            wedge;
        value           nonuniform List<scalar> 
14000
(
1.02499111e-22
-5.44107409e-23
1.25801609e-23
-1.86030776e-21
4.22903573e-21
-8.69288142e-21
1.03258731e-20
-1.92644823e-25
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
