test_cases/wallBoiling_template/0.orig/phi.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0.5";
    object      phi.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
27610
(
-3.55594847e-13
1.95256007e-09
-1.09111534e-13
5.72229305e-09
-9.01013573e-13
9.29281211e-09
-1.93517706e-12
1.26702189e-08
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
40
(
-1.95218524e-09
-5.72115332e-09
-9.29093582e-09
-1.26676588e-08
-1.58576225e-08
-1.88669673e-08
-2.17015344e-08
-2.43668181e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
1.95220601e-09
5.72017289e-09
9.28573388e-09
1.26556417e-08
1.58376909e-08
1.88391715e-08
2.16665153e-08
2.43253956e-08
...
)
;
    }
    front
    {
        type            wedge;
        value           nonuniform List<scalar> 
14000
(
-1.46571076e-22
-4.53125994e-23
6.10190202e-23
-1.74825124e-21
4.14357681e-21
-8.13606162e-21
1.05932392e-20
5.35435547e-22
...
)
;
    }
    back
    {
        type            wedge;
        value           nonuniform List<scalar> 
14000
(
1.01824542e-22
-5.60311395e-23
7.74144821e-24
-1.80290409e-21
4.11877261e-21
-8.48832199e-21
1.00915381e-20
-4.19334096e-24
...
)
;
    }
    wall
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
