test_cases/wallBoiling_template/0.orig/thermalPhaseChange:Tf.gas_liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      thermalPhaseChange:Tf.gas_liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
341.682547
341.682547
341.682547
341.682547
341.682548
341.68255
341.682552
341.682555
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
341.666444
341.666444
341.666444
341.666444
341.666444
341.666445
341.666445
341.666446
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
341.671178
341.671178
341.671177
341.671177
341.671177
341.671176
341.671175
341.671175
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
350
(
341.67754
341.6868
341.68701
341.683157
341.674373
341.666107
341.662489
341.662914
...
)
;
    }
}


// ************************************************************************* //
