test_cases/wallBoiling_template/Allrun.pre
#!/bin/sh
cd "$(dirname "$(readlink -f "$0")")" || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication extrudeMesh
runApplication topoSet

cp -r 0.orig 0

runApplication decomposePar

#------------------------------------------------------------------------------
